{
  "format": "layers-model",
  "generatedBy": "Antigravity-Numpy-Exporter",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "batch_input_shape": [
              null,
              9
            ],
            "dtype": "float32",
            "units": 16,
            "activation": "relu",
            "use_bias": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": "float32",
            "units": 8,
            "activation": "relu",
            "use_bias": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_2",
            "trainable": true,
            "dtype": "float32",
            "units": 3,
            "activation": "softmax",
            "use_bias": true
          }
        }
      ]
    },
    "keras_version": "2.15.0",
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense/kernel",
          "shape": [
            9,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            16,
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            8,
            3
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            3
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}